unit_4/app/models/user.rb

  def self.posts_of_moderators
    User.where(moderator: true).pluck(:id).map{ |e|  User.find(e).posts.size}.sum
---
SELECT "users"."id" FROM "users" WHERE "users"."moderator" = $1  [["moderator", true]]